 Extracted from page: UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical
URL: http://localhost:5173/

Extracted content:
```json
{
  "title": "UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical",
  "url": "http://localhost:5173/",
  "summary": "El Portal Sindical UGT Towa es una plataforma dedicada a la Uni贸n General de Trabajadores de Towa Pharmaceutical Europe, dise帽ada para facilitar la comunicaci贸n, participaci贸n y conexi贸n de los empleados con sus representantes sindicales. Ofrece acceso r谩pido a informaci贸n importante, servicios clave y canales de interacci贸n para sus afiliados. El portal promueve la transparencia y la implicaci贸n de los trabajadores en la actividad sindical a trav茅s de comunicados, encuestas y eventos, adem谩s de proveer herramientas para la defensa de los derechos laborales.",
  "key_points": [
    "**Portal UGT Towa**: Plataforma principal de comunicaci贸n y participaci贸n para los trabajadores de Towa Pharmaceutical.",
    "**Acceso a la Aplicaci贸n M贸vil**: Promoci贸n destacada para instalar una aplicaci贸n m贸vil que ofrece acceso r谩pido, notificaciones autom谩ticas y funcionalidad sin internet.",
    "**Navegaci贸n Principal**: Incluye secciones como Inicio, Qui茅nes Somos, Comunicados, Citas, Documentos, Encuestas, Newsletter y Afiliados (con dashboard).",
    "**Bienvenida y Prop贸sito**: Presenta el portal como una plataforma para estar informado, participar y conectar con los representantes sindicales.",
    "**Servicios Destacados**: Permite solicitar citas con representantes y ver comunicados importantes.",
    "**Galer铆a de Eventos**: Muestra momentos destacados de la actividad sindical con descripciones de visitas, manifestaciones y reuniones (ej. visita presidenta comit茅 LUCTA, visita delegado UGT AGC Pharma Chemicals, apoyo a huelga Intermas Group, visita a Grifols, manifestaci贸n reducci贸n jornada, asamblea sobre nuevo convenio, significado de la bandera UGT).",
    "**Encuestas Activas**: Permite la participaci贸n de los usuarios en encuestas sobre temas relevantes para futuras negociaciones o mejoras del portal, mostrando d铆as restantes y estado (Activa).",
    "**ltimos Comunicados**: Publica noticias y convocatorias relevantes como la asamblea del Comit茅 de Empresa, reuniones con el Departamento de People sobre el Calendario Laboral 2026 y la bienvenida al portal.",
    "**Accesos R谩pidos**: Enlaces directos a 'Qui茅nes Somos', 'Solicitar Cita' y 'Buz贸n de Sugerencias'.",
    "**Buz贸n de Sugerencias An贸nimas**: Un canal para que los usuarios compartan ideas, comentarios o preocupaciones de forma confidencial.",
    "**Afiliaci贸n**: Presenta un c贸digo QR para facilitar el proceso de afiliaci贸n a UGT.",
    "**Contacto**: Proporciona informaci贸n de contacto (correo electr贸nico, tel茅fono) y la entidad a la que pertenece (Towa Pharmaceutical Europe).",
    "**Sobre UGT Towa**: Describe la misi贸n de la secci贸n sindical de UGT en Towa Pharmaceutical Europe, enfocada en la defensa de los derechos laborales y el bienestar de los trabajadores."
  ],
  "relevant_links": [
    "/",
    "/quienes-somos",
    "/comunicados",
    "/citas",
    "/documentos",
    "/encuestas",
    "/newsletter",
    "/afiliados/dashboard",
    "/comunicados/512e77b8-016a-4542-a79f-600a5168f0a5",
    "/comunicados/9dff224d-665f-4f17-a5db-6eaa913466c4",
    "/comunicados/18051306-3625-4d00-8634-fd89a13466c4",
    "#sugerencias"
  ],
  "file_name": "ugt_towa_portal_sindical_content.json"
}
```
