 Extracted from page: UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical
URL: https://ugt.towa.cat/

Extracted content:
```json
{
    "title": "UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical",
    "url": "https://ugt.towa.cat/",
    "summary": "El Portal Sindical UGT Towa es una plataforma dedicada a los trabajadores de Towa Pharmaceutical, gestionada por la Secci贸n Sindical de UGT. Su objetivo principal es facilitar la comunicaci贸n, la participaci贸n y la conexi贸n entre los empleados y sus representantes sindicales. La p谩gina ofrece acceso a comunicados oficiales, encuestas activas para recoger la opini贸n de los trabajadores, un sistema de solicitud de citas con los representantes, una galer铆a de eventos para mostrar la actividad sindical, y un buz贸n de sugerencias an贸nimas. Tambi茅n promueve la instalaci贸n de una aplicaci贸n m贸vil para acceso r谩pido y notificaciones, y proporciona informaci贸n de contacto para la secci贸n sindical, incluyendo un QR para la afiliaci贸n.",
    "key_points": [
        "Plataforma sindical para la comunicaci贸n, participaci贸n y conexi贸n de trabajadores con UGT Towa.",
        "Disponibilidad de una aplicaci贸n m贸vil para acceso r谩pido y notificaciones.",
        "Secciones clave incluyen: Comunicados, Citas, Encuestas, Galer铆a de Eventos, Qui茅nes Somos y Buz贸n de Sugerencias.",
        "Posibilidad de participar en encuestas activas sobre temas relevantes para los trabajadores.",
        "Acceso a los 煤ltimos comunicados de la Secci贸n Sindical de UGT.",
        "Buz贸n de Sugerencias An贸nimas para compartir ideas y preocupaciones de forma confidencial.",
        "Informaci贸n de contacto directo con la Secci贸n Sindical de UGT Towa y un QR para facilitar la afiliaci贸n.",
        "Compromiso con la defensa de los derechos laborales y el bienestar de los trabajadores de Towa Pharmaceutical Europe."
    ],
    "relevant_links": [
        "/",
        "/quienes-somos",
        "/comunicados",
        "/citas",
        "/encuestas",
        "/newsletter",
        "/login",
        "/register",
        "/comunicados/512e77b8-016a-4542-a79f-600a5168f0a5",
        "/comunicados/9dff224d-665f-4f17-a5db-6eaa913466c4",
        "/comunicados/18051306-3625-4d00-8634-fd89a1e3bc94",
        "#sugerencias"
    ],
    "file_name": "ugt_towa_portal_sindical.json"
}
```
