 Extracted from page: UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical
URL: http://localhost:5173/

Extracted content:
```json
{
  "title": "UGT Towa - Portal Sindical | Uni贸n General de Trabajadores Towa Pharmaceutical",
  "url": "http://localhost:5173/",
  "summary": "La secci贸n 'Galer铆a de Eventos' se ha cargado correctamente y muestra una colecci贸n de momentos destacados de la actividad sindical de UGT Towa. La secci贸n incluye un t铆tulo, una breve descripci贸n de su prop贸sito y listados individuales para cada evento, indicando la presencia de 7 eventos en total, de los cuales 7 est谩n detallados en la p谩gina proporcionada.",
  "key_points": [
    "**T铆tulo de la secci贸n:** Galer铆a de Eventos.",
    "**Subt铆tulo:** Momentos destacados de nuestra actividad sindical.",
    "**Contador de eventos:** Se indica 'Mostrando 6 de 7 eventos', aunque la p谩gina muestra detalles de 7 eventos distintos.",
    "**Formato de evento:** Cada entrada de la galer铆a incluye una imagen (indicada), un t铆tulo del evento, una fecha y una descripci贸n detallada del mismo.",
    "**Eventos visibles y sus descripciones:**",
    "   - **Visita Presidenta Comite LUCTA (23 de septiembre, 2025):** Reuni贸n con la presidenta del comit茅 de LUCTA y el responsable de acci贸n sindical del Vall猫s Oriental-Maresme para compartir acuerdos y beneficios, como parte de una ronda de contacto con empresas de la zona.",
    "   - **Visita Delegado Sindical AGC Pharma Chemicals (13 de junio, 2025):** Recepci贸n del delegado sindical de UGT en AGC Pharma Chemicals para intercambiar ideas y conocer sus condiciones laborales y beneficios sociales.",
    "   - **Huelga Descuelgue Intermas Group (24 de abril, 2025):** Apoyo a los compa帽eros de Intermas Group por una reducci贸n salarial del 23% aplicada mediante el art铆culo 41, con cr铆tica a la normalizaci贸n de esta pr谩ctica.",
    "   - **Visita a la Farmac茅utica Grifols (14 de marzo, 2025):** Delegaci贸n sindical se re煤ne con la secci贸n de UGT en Grifols para conocer acuerdos y beneficios, y visita a antiguos compa帽eros de Towa.",
    "   - **Manifestaci贸n Reducci贸n Jornada (5 de marzo, 2025):** Presencia de la secci贸n sindical de UGT Towa en una manifestaci贸n a favor de la reducci贸n de la jornada laboral.",
    "   - **Asamblea sobre Art铆culos del Nuevo Convenio (26 de febrero, 2025):** Delegados asistiendo a una reuni贸n informativa en la central de UGT de Barcelona para conocer las modificaciones y mejoras del convenio de la industria qu铆mica.",
    "   - **Bandera de la UGT (9 de noviembre, 2024):** Descripci贸n de la bandera de la UGT como s铆mbolo de unidad y lucha obrera, destacando su color rojo, las letras 'UGT' y el emblema del apret贸n de manos."
  ],
  "relevant_links": [
    "Ver galer铆a"
  ],
  "file_name": "ugt_towa_galeria_eventos.json"
}
```
